ПУМП/src/Catalogs/F003_O/F003_O.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>F003_O</name>
  <comment>Отделения Медицинских организаций</comment>
  <hierarchyType>HierarchyOfItems</hierarchyType>
  <attributes>
    <name>MCOD</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>6</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ID_PODR</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>9</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>USL_OK</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>PROF</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>DATE_BEG</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>DATE_END</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

ПУМП/src/Catalogs/F003/F003.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>F003</name>
  <comment>Реестр Медицинских Организаций </comment>
  <attributes>
    <name>TF_OKATO</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>6</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>NAM_MOP</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>NAM_MOK</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>NAME</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>INN</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>12</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>OGRN</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>KPP</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>9</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>INDEX_J</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>6</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ADDR_J</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>254</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>OKOPF</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>2</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>VEDPRI</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>2</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>FAM_RUK</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>IM_RUK</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>OT_RUK</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>PHONE</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>40</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>FAX</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>40</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>EMAIL</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>SOLIST</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>WWW</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>D_BEGIN</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>D_END</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>NAME_E</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>D_EDIT</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Подразделения</name>
    <attributes>
      <name>ID_PODR</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>9</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>NAME_PODR</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>254</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ADDR_P</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>254</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>TYPE_BRANCH</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Документы</name>
    <attributes>
      <name>N_DOC</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>30</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>D_START</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>DATA_E</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

ПУМП/src/Catalogs/V006/V006.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>V006</name>
  <comment>Классификатор Условий Оказания Медицинской Помощи (V006)</comment>
  <attributes>
    <name>ID</name>
    <comment>ИД</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>NAME</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>254</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>DATE_BEG</name>
    <comment>Дата начала</comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>DATE_END</name>
    <comment>Дата окончания</comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСоздания</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаИзменения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ВведенВручную</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Catalog>

ПУМП/src/Catalogs/V002/V002.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>V002</name>
  <comment>Профили оказанной медицинской помощи</comment>
  <attributes>
    <name>ID</name>
    <comment>ИД</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>NAME</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>254</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>DATE_BEG</name>
    <comment>Дата начала</comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>DATE_END</name>
    <comment>Дата окончания</comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСоздания</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаИзменения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ВведенВручную</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Catalog>

ПУМП/src/Catalogs/F003_O/Forms/ФормаЭлемента/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Ссылка=Объект.Ссылка;
	Если  ССылка.Пустая() Тогда
		Возврат;
	КонецЕсли;		
	Запрос=Новый Запрос;
	Запрос.Текст=(
	"ВЫБРАТЬ
	|	F003_O.MCOD,
	|	F003_O.ID_PODR КАК ID_PODR,
	|	F003_O.Ссылка,
	|	F003_O.USL_OK,
	|	F003_O.PROF,
	|	V002.NAME КАК PROF_NAME,
	|	V002.Ссылка КАК PROF_REF,
	|	V006.NAME КАК USL_OK_NAME,
	|	V006.Ссылка КАК USL_OK_REF,
	|	F003.NAME КАК MCOD_NAME,
	|	F003.Ссылка КАК MCOD_REF,
	|	F003.Подразделения КАК Подразделения
	|ИЗ
	|	Справочник.F003_O КАК F003_O
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.F003 КАК F003
	|		ПО F003_O.MCOD = F003.Код
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.V006 КАК V006
	|		ПО V006.ID = F003_O.USL_OK
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.V002 КАК V002
	|		ПО V002.ID = F003_O.PROF
	|ГДЕ
	|	F003_O.Ссылка = &Ссылка"
	);
	Запрос.УстановитьПараметр("Ссылка",Ссылка);
	ТЗ=Запрос.Выполнить().Выгрузить();
	Если ТЗ.Количество()>0 Тогда
		СтрТЗ=ТЗ[0];
		MCOD_NAME=СтрТЗ.MCOD_NAME;
		USL_OK_NAME=СтрТЗ.USL_OK_NAME;
		PROF_NAME=СтрТЗ.PROF_NAME;
		MCOD_REF=СтрТЗ.MCOD_REF;
		USL_OK_REF=СтрТЗ.USL_OK_REF;
		PROF_REF=СтрТЗ.PROF_REF;
		
		Для Каждого Стр ИЗ СтрТЗ.Подразделения Цикл
			Если Стр.ID_PODR=СтрТЗ.ID_PODR Тогда
				ID_PODR_NAME=Стр.NAME_PODR;
				Прервать;
			КонецЕсли;	
		КонецЦикла;	
		
	КонецЕсли;	
КонецПроцедуры


&НаКлиенте
Процедура MCOD_NAMEНажатие(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка=Ложь;
	пСсылка=MCOD_REF;
	Попытка
		ПараметрыФормы = Новый Структура("Ключ", пССылка);
		ОткрытьФорму("Справочник.F003.ФормаОбъекта", ПараметрыФормы);
	Исключение
	КонецПопытки;
			
КонецПроцедуры

&НаКлиенте
Процедура ID_PODR_NAMEНажатие(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка=Ложь;
	пСсылка=MCOD_REF;
	Попытка
		ПараметрыФормы = Новый Структура("Ключ", пССылка);
		ОткрытьФорму("Справочник.F003.ФормаОбъекта", ПараметрыФормы);
	Исключение
	КонецПопытки;
КонецПроцедуры

&НаКлиенте
Процедура USL_OK_NAMEНажатие(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка=Ложь;
	пСсылка=USL_OK_REF;
	Попытка
		ПараметрыФормы = Новый Структура("Ключ", пССылка);
		ОткрытьФорму("Справочник.V006.ФормаОбъекта", ПараметрыФормы);
	Исключение
	КонецПопытки;

КонецПроцедуры

&НаКлиенте
Процедура PROF_NAMEНажатие(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка=Ложь;
	пСсылка=PROF_REF;
	Попытка
		ПараметрыФормы = Новый Структура("Ключ", пССылка);
		ОткрытьФорму("Справочник.V002.ФормаОбъекта", ПараметрыФормы);
	Исключение
	КонецПопытки;
КонецПроцедуры
